[
  {
    "description": "Alouette Sundried Tomato and Basil Bisque might be a good recipe to expand your soup recipe box. Watching your figure? This gluten free and dairy free recipe has <b>44 calories</b>, <b>1g of protein</b>, and <b>1g of fat</b> per serving. This recipe serves 8 and costs 35 cents per serving. 83 people were impressed by this recipe. It is brought to you by Foodista. From preparation to the plate, this recipe takes roughly <b>roughly 45 minutes</b>. Head to the store and pick up bacon, all natural tomato soup, alouette all natural sundried tomato and basil spreadable cheese, and a few other things to make it today. Taking all factors into account, this recipe <b>earns a spoonacular score of 22%</b>, which is rather bad. Try <a href=\"https://spoonacular.com/recipes/sundried-tomato-basil-and-goats-cheese-pasta-27264\">Sundried Tomato, Basil And Goats Cheese Pasta</a>, <a href=\"https://spoonacular.com/recipes/sundried-tomato-and-basil-cream-cheese-spread-594907\">Sundried Tomato and Basil Cream Cheese Spread</a>, and <a href=\"https://spoonacular.com/recipes/tomato-basil-bisque-211806\">Tomato-Basil Bisque</a> for similar recipes.",
    "title": "Alouette Sundried Tomato and Basil Bisque",
    "vegetarian": false,
    "time": 45,
    "cheap": false,
    "glutenfree": true,
    "pricePerServing": 34.82,
    "servings": 8,
    "image": "https://spoonacular.com/recipeImages/632250-556x370.jpg"
  },
  {
    "description": "If you want to add more <b>dairy free</b> recipes to your collection, Toasted\" Agnolotti (or Ravioli) might be a recipe you should try. One serving contains <b>965 calories</b>, <b>41g of protein</b>, and <b>28g of fat</b>. For <b>$1.95 per serving</b>, this recipe <b>covers 21%</b> of your daily requirements of vitamins and minerals. This recipe serves 2. It works well as a main course. 7 people have tried and liked this recipe. If you have g pre-made agnolotti/ravioli, egg, breadcrumbs, and a few other ingredients on hand, you can make it. Not a lot of people really liked this Mediterranean dish. It is brought to you by Foodista. From preparation to the plate, this recipe takes around <b>around 45 minutes</b>. Taking all factors into account, this recipe <b>earns a spoonacular score of 59%</b>, which is pretty good. Users who liked this recipe also liked <a href=\"https://spoonacular.com/recipes/butternut-squash-ravioli-agnolotti-di-zucca-375353\">Butternut Squash Ravioli: Agnolotti di Zucca</a>, <a href=\"https://spoonacular.com/recipes/toasted-ravioli-426313\">Toasted Ravioli</a>, and <a href=\"https://spoonacular.com/recipes/toasted-ravioli-756780\">Toasted Ravioli</a>.",
    "title": "Toasted\" Agnolotti (or Ravioli)",
    "vegetarian": false,
    "time": 45,
    "cheap": false,
    "glutenfree": false,
    "pricePerServing": 195.19,
    "servings": 2,
    "image": "https://spoonacular.com/recipeImages/631807-556x370.jpg"
  },
  {
    "description": "Easy Onion Cheese Rounds might be just the side dish you are searching for. For <b>25 cents per serving</b>, this recipe <b>covers 5%</b> of your daily requirements of vitamins and minerals. This recipe serves 8. One portion of this dish contains about <b>3g of protein</b>, <b>12g of fat</b>, and a total of <b>171 calories</b>. A mixture of onion, mayonnaise, parsley, and a handful of other ingredients are all it takes to make this recipe so flavorful. 64 people were glad they tried this recipe. From preparation to the plate, this recipe takes approximately <b>approximately 45 minutes</b>. It is brought to you by Foodista. Overall, this recipe earns a <b>not so excellent spoonacular score of 26%</b>. Similar recipes include <a href=\"https://spoonacular.com/recipes/onion-almond-rounds-428613\">Onion Almond Rounds</a>, <a href=\"https://spoonacular.com/recipes/garlic-onion-appetizer-rounds-396253\">Garlic-Onion Appetizer Rounds</a>, and <a href=\"https://spoonacular.com/recipes/easy-cheese-onion-slice-210372\">Easy cheese & onion slice</a>.",
    "title": "Easy Onion Cheese Rounds",
    "vegetarian": false,
    "time": 45,
    "cheap": false,
    "glutenfree": false,
    "pricePerServing": 24.75,
    "servings": 8,
    "image": "https://spoonacular.com/recipeImages/642041-556x370.jpg"
  },
  {
    "description": "The recipe Black Bean and Peppers Taco Filling is ready <b>in roughly 45 minutes</b> and is definitely an excellent <b>gluten free and vegan</b> option for lovers of Mexican food. For <b>52 cents per serving</b>, this recipe <b>covers 11%</b> of your daily requirements of vitamins and minerals. This recipe makes 8 servings with <b>117 calories</b>, <b>5g of protein</b>, and <b>3g of fat</b> each. This recipe is liked by 10 foodies and cooks. Head to the store and pick up chili powder, paprika, canned tomatoes, and a few other things to make it today. All things considered, we decided this recipe <b>deserves a spoonacular score of 87%</b>. This score is amazing. Try <a href=\"https://spoonacular.com/recipes/kale-turkey-and-black-bean-taco-filling-plus-5-ways-to-use-it-506463\">Kale, Turkey and Black Bean Taco Filling -Plus 5 Ways to Use It</a>, <a href=\"https://spoonacular.com/recipes/pinquito-bean-and-quinoa-taco-filling-628625\">Pinquito Bean and Quinoa Taco Filling</a>, and <a href=\"https://spoonacular.com/recipes/easy-baked-refried-bean-dip-or-taco-or-burrito-filling-859342\">Easy Baked Refried Bean Dip (or taco or burrito filling)</a> for similar recipes.",
    "title": "Black Bean and Peppers Taco Filling",
    "vegetarian": true,
    "time": 45,
    "cheap": false,
    "glutenfree": true,
    "pricePerServing": 54.61,
    "servings": 8,
    "image": "https://spoonacular.com/recipeImages/635058-556x370.jpg"
  },
  {
    "description": "If you have around <b>around 45 minutes</b> to spend in the kitchen, Roasted Endive Salad With Prosciutto, Figs and Pistachios might be a spectacular <b>gluten free, dairy free, paleolithic, and primal</b> recipe to try. One serving contains <b>494 calories</b>, <b>13g of protein</b>, and <b>24g of fat</b>. This recipe serves 4 and costs $3.64 per serving. If you have endive, figs, pistachio nuts, and a few other ingredients on hand, you can make it. 6 people were impressed by this recipe. It is brought to you by Foodista. It works well as a main course. Taking all factors into account, this recipe <b>earns a spoonacular score of 96%</b>, which is spectacular. <a href=\"https://spoonacular.com/recipes/frise-salad-with-prosciutto-roasted-figs-and-walnuts-96484\">Frisée Salad with Prosciutto, Roasted Figs, and Walnuts</a>, <a href=\"https://spoonacular.com/recipes/chicory-and-endive-salad-with-spiced-pistachios-12783\">Chicory and Endive Salad with Spiced Pistachios</a>, and <a href=\"https://spoonacular.com/recipes/prosciutto-roasted-figs-130081\">Prosciutto Roasted Figs</a> are very similar to this recipe.",
    "title": "Roasted Endive Salad With Prosciutto, Figs and Pistachios",
    "vegetarian": false,
    "time": 45,
    "cheap": false,
    "glutenfree": true,
    "pricePerServing": 363.51,
    "servings": 4,
    "image": "https://spoonacular.com/recipeImages/658579-556x370.jpg"
  },
  {
    "description": "Pecan Pumpkin Pie Dessert Pizza with Maple Whipped Cream might be just the <b>Mediterranean</b> recipe you are searching for. For <b>$1.41 per serving</b>, you get a dessert that serves 10. One serving contains <b>394 calories</b>, <b>6g of protein</b>, and <b>29g of fat</b>. <b>Thanksgiving</b> will be even more special with this recipe. 25 people have tried and liked this recipe. From preparation to the plate, this recipe takes around <b>45 minutes</b>. A mixture of brown sugar, pumpkin pie filling/mix, pecans, and a handful of other ingredients are all it takes to make this recipe so delicious. All things considered, we decided this recipe <b>deserves a spoonacular score of 37%</b>. This score is rather bad. Try <a href=\"https://spoonacular.com/recipes/no-bake-pumpkin-tart-with-maple-pecan-whipped-cream-555266\">No-Bake Pumpkin Tart with Maple-Pecan Whipped Cream</a>, <a href=\"https://spoonacular.com/recipes/maple-and-toasted-pecan-pie-with-maple-whipped-cream-522808\">Maple and Toasted Pecan Pie with Maple Whipped Cream</a>, and <a href=\"https://spoonacular.com/recipes/maple-pumpkin-mini-cheesecakes-with-brown-sugar-maple-whipped-cream-579456\">Maple Pumpkin Mini Cheesecakes with Brown Sugar Maple Whipped Cream</a> for similar recipes.",
    "title": "Pecan Pumpkin Pie Dessert Pizza with Maple Whipped Cream",
    "vegetarian": false,
    "time": 45,
    "cheap": false,
    "glutenfree": false,
    "pricePerServing": 140.59,
    "servings": 10,
    "image": "https://spoonacular.com/recipeImages/655525-556x370.jpg"
  },
  {
    "description": "The recipe A Classic Caesar Salad could satisfy your American craving in roughly <b>45 minutes</b>. One serving contains <b>1699 calories</b>, <b>40g of protein</b>, and <b>126g of fat</b>. For <b>$6.15 per serving</b>, you get a main course that serves 1. 7 people have made this recipe and would make it again. Head to the store and pick up thickly crusty bread, tabasco sauce, romaine lettuce, and a few other things to make it today. To use up the egg yolk you could follow this main course with the <a href=\"https://spoonacular.com/recipes/portuguese-egg-custard-tarts-924983\">Portuguese Egg Custard Tarts</a> as a dessert. All things considered, we decided this recipe <b>deserves a spoonacular score of 95%</b>. This score is great. Try <a href=\"https://spoonacular.com/recipes/classic-caesar-salad-505\">Classic Caesar Salad</a>, <a href=\"https://spoonacular.com/recipes/classic-caesar-salad-268870\">Classic Caesar Salad</a>, and <a href=\"https://spoonacular.com/recipes/classic-caesar-salad-373223\">Classic Caesar Salad</a> for similar recipes.",
    "title": "A Classic Caesar Salad",
    "vegetarian": false,
    "time": 45,
    "cheap": false,
    "glutenfree": false,
    "pricePerServing": 612.16,
    "servings": 1,
    "image": "https://spoonacular.com/recipeImages/631890-556x370.jpg"
  },
  {
    "description": "You can never have too many soup recipes, so give Shrimp and Lemongrass Soup a try. This recipe serves 4 and costs $1.68 per serving. One serving contains <b>123 calories</b>, <b>9g of protein</b>, and <b>3g of fat</b>. If you have daikon, bean sprouts, mint, and a few other ingredients on hand, you can make it. It is a good option if you're following a <b>gluten free, dairy free, whole 30, and pescatarian</b> diet. It is brought to you by Foodista. It is perfect for <b>Autumn</b>. This recipe is liked by 13 foodies and cooks. From preparation to the plate, this recipe takes around <b>around 45 minutes</b>. Taking all factors into account, this recipe <b>earns a spoonacular score of 75%</b>, which is solid. If you like this recipe, take a look at these similar recipes: <a href=\"https://spoonacular.com/recipes/trying-something-new-shrimp-with-lemongrass-5915\">Trying Something New: Shrimp with Lemongrass</a>, <a href=\"https://spoonacular.com/recipes/lemongrass-shrimp-5322\">Lemongrass Shrimp</a>, and <a href=\"https://spoonacular.com/recipes/lemongrass-chicken-shrimp-5304\">Lemongrass Chicken Shrimp</a>.",
    "title": "Shrimp and Lemongrass Soup",
    "vegetarian": false,
    "time": 45,
    "cheap": false,
    "glutenfree": true,
    "pricePerServing": 168.22,
    "servings": 4,
    "image": "https://spoonacular.com/recipeImages/659934-556x370.jpg"
  },
  {
    "description": "Four-Berry Blast Fruit Smoothie might be just the morn meal you are searching for. This gluten free and vegetarian recipe serves 4 and costs <b>$1.24 per serving</b>. One serving contains <b>264 calories</b>, <b>11g of protein</b>, and <b>11g of fat</b>. Only a few people made this recipe, and 5 would say it hit the spot. From preparation to the plate, this recipe takes approximately <b>10 minutes</b>. Head to the store and pick up milk, raspberries, lemonade concentrate, and a few other things to make it today. All things considered, we decided this recipe <b>deserves a spoonacular score of 74%</b>. This score is solid. Similar recipes include <a href=\"https://spoonacular.com/recipes/ginger-berry-fruit-smoothie-482626\">Ginger Berry Fruit Smoothie</a>, <a href=\"https://spoonacular.com/recipes/berry-banana-fruit-smoothie-265532\">Berry-Banana Fruit Smoothie</a>, and <a href=\"https://spoonacular.com/recipes/berry-blast-smoothies-397587\">Berry Blast Smoothies</a>.",
    "title": "Four-Berry Blast Fruit Smoothie",
    "vegetarian": true,
    "time": 10,
    "cheap": false,
    "glutenfree": true,
    "pricePerServing": 123.98,
    "servings": 4,
    "image": "https://spoonacular.com/recipeImages/643241-556x370.jpg"
  },
  {
    "description": "You can never have too many main course recipes, so give Grilled Fish With Sun Dried Tomato Relish a try. One serving contains <b>703 calories</b>, <b>42g of protein</b>, and <b>25g of fat</b>. This gluten free, dairy free, fodmap friendly, and pescatarian recipe serves 2 and costs <b>$7.34 per serving</b>. 16 people have tried and liked this recipe. It can be enjoyed any time, but it is especially good for <b>The Fourth Of July</b>. If you have pepper, extra virgin olive oil, salt, and a few other ingredients on hand, you can make it. To use up the salt you could follow this main course with the <a href=\"https://spoonacular.com/recipes/apple-turnovers-recipe-48175\">Apple Turnovers Recipe</a> as a dessert. All things considered, we decided this recipe <b>deserves a spoonacular score of 93%</b>. This score is amazing. Try <a href=\"https://spoonacular.com/recipes/artichoke-and-sun-dried-tomato-pasta-926592\">Artichoke and Sun Dried Tomato Pasta</a>, <a href=\"https://spoonacular.com/recipes/grilled-tuna-with-sun-dried-tomato-relish-8067\">Grilled Tuna With Sun-dried Tomato Relish</a>, and <a href=\"https://spoonacular.com/recipes/sun-dried-tomato-pesto-pasta-with-zoodles-914788\">Sun Dried Tomato Pesto Pasta with Zoodles</a> for similar recipes.",
    "title": "Grilled Fish With Sun Dried Tomato Relish",
    "vegetarian": false,
    "time": 45,
    "cheap": false,
    "glutenfree": true,
    "pricePerServing": 889.37,
    "servings": 2,
    "image": "https://spoonacular.com/recipeImages/645714-556x370.jpg"
  },
  {
    "description": "Need a <b>gluten free and primal main course</b>? Pesto Chicken Zoodles could be an amazing recipe to try. For <b>$2.5 per serving</b>, this recipe <b>covers 26%</b> of your daily requirements of vitamins and minerals. One serving contains <b>524 calories</b>, <b>35g of protein</b>, and <b>41g of fat</b>. From preparation to the plate, this recipe takes roughly <b>45 minutes</b>. 22 people have made this recipe and would make it again. Head to the store and pick up cajun seasoning, chicken breasts seasoned, olive oil, and a few other things to make it today. To use up the olive oil you could follow this main course with the <a href=\"https://spoonacular.com/recipes/sauteed-banana-granola-and-yogurt-parfait-624619\">Sauteed Banana, Granolan and Yogurt Parfait</a> as a dessert. All things considered, we decided this recipe <b>deserves a spoonacular score of 76%</b>. This score is solid. Similar recipes include <a href=\"https://spoonacular.com/recipes/pesto-zoodles-with-chicken-757213\">Pesto Zoodles with Chicken</a>, <a href=\"https://spoonacular.com/recipes/shrimp-and-pesto-zoodles-874131\">Shrimp and Pesto Zoodles</a>, and <a href=\"https://spoonacular.com/recipes/low-fat-vegan-pesto-zoodles-with-broccoli-720890\">Low Fat Vegan Pesto Zoodles with Broccoli</a>.",
    "title": "Pesto Chicken Zoodles",
    "vegetarian": false,
    "time": 45,
    "cheap": false,
    "glutenfree": true,
    "pricePerServing": 274.6,
    "servings": 3,
    "image": "https://spoonacular.com/recipeImages/780001-556x370.jpg"
  },
  {
    "description": "Crispy Tiger Prawns With Honey and Garlic Sauce could be just the <b>gluten free, dairy free, and pescatarian</b> recipe you've been looking for. One serving contains <b>159 calories</b>, <b>6g of protein</b>, and <b>8g of fat</b>. This recipe serves 3. For <b>$1.16 per serving</b>, this recipe <b>covers 5%</b> of your daily requirements of vitamins and minerals. From preparation to the plate, this recipe takes approximately <b>approximately 45 minutes</b>. 7 people have made this recipe and would make it again. A mixture of shao hsing wine, honey, egg yolk, and a handful of other ingredients are all it takes to make this recipe so flavorful. It is brought to you by Foodista. All things considered, we decided this recipe <b>deserves a spoonacular score of 15%</b>. This score is rather bad. <a href=\"https://spoonacular.com/recipes/crispy-tiger-prawns-with-honey-and-garlic-sauce-75765\">Crispy Tiger Prawns With Honey And Garlic Sauce</a>, <a href=\"https://spoonacular.com/recipes/celeriac-espuma-with-ras-el-hanout-steamed-tiger-prawns-11921\">Celeriac Espuma With Ras-el-hanout Steamed Tiger Prawns</a>, and <a href=\"https://spoonacular.com/recipes/crispy-prawns-with-cucumber-dipping-sauce-23071\">Crispy Prawns With Cucumber Dipping Sauce</a> are very similar to this recipe.",
    "title": "Crispy Tiger Prawns With Honey and Garlic Sauce",
    "vegetarian": false,
    "time": 45,
    "cheap": false,
    "glutenfree": true,
    "pricePerServing": 116.12,
    "servings": 3,
    "image": "https://spoonacular.com/recipeImages/640844-556x370.jpg"
  },
  {
    "description": "The recipe Chicken En Papillote With Basil and Cherry Tomatoes can be made <b>in around around 45 minutes</b>. One portion of this dish contains roughly <b>25g of protein</b>, <b>31g of fat</b>, and a total of <b>434 calories</b>. For <b>$2.62 per serving</b>, this recipe <b>covers 18%</b> of your daily requirements of vitamins and minerals. This recipe serves 1. 26 people found this recipe to be yummy and satisfying. Head to the store and pick up garnish: basil chiffonade, to 5 cherry tomatoes, olive oil, and a few other things to make it today. It is brought to you by Foodista. It is a good option if you're following a <b>gluten free, dairy free, paleolithic, and primal</b> diet. With a spoonacular <b>score of 65%</b>, this dish is good. Similar recipes include <a href=\"https://spoonacular.com/recipes/tilapia-en-papillote-with-cherry-tomatoes-peppers-olives-6920\">Tilapian En Papillote with Cherry Tomatoes, Peppers & Olives</a>, <a href=\"https://spoonacular.com/recipes/spaghetti-with-crab-cherry-tomatoes-basil-215647\">Spaghetti with crab, cherry tomatoes & basil</a>, and <a href=\"https://spoonacular.com/recipes/skillet-charred-cherry-tomatoes-with-basil-30957\">Skillet-Charred Cherry Tomatoes with Basil</a>.",
    "title": "Chicken En Papillote With Basil and Cherry Tomatoes",
    "vegetarian": false,
    "time": 45,
    "cheap": false,
    "glutenfree": true,
    "pricePerServing": 262.25,
    "servings": 1,
    "image": "https://spoonacular.com/recipeImages/638071-556x370.jpg"
  },
  {
    "description": "Buttermilk Onion Rings is a hor d'oeuvre that serves 3. One portion of this dish contains roughly <b>19g of protein</b>, <b>327g of fat</b>, and a total of <b>3262 calories</b>. For <b>$2.25 per serving</b>, this recipe <b>covers 29%</b> of your daily requirements of vitamins and minerals. If you have vegetable oil, salt, baking powder, and a few other ingredients on hand, you can make it. 18 people have made this recipe and would make it again. It is brought to you by Foodista. From preparation to the plate, this recipe takes around <b>around 45 minutes</b>. Overall, this recipe earns a <b>good spoonacular score of 74%</b>. Similar recipes include <a href=\"https://spoonacular.com/recipes/buttermilk-onion-rings-599002\">Buttermilk Onion Rings</a>, <a href=\"https://spoonacular.com/recipes/buttermilk-onion-rings-750066\">Buttermilk Onion Rings</a>, and <a href=\"https://spoonacular.com/recipes/bistro-steak-with-buttermilk-onion-rings-863735\">Bistro Steak with Buttermilk Onion Rings</a>.",
    "title": "Buttermilk Onion Rings",
    "vegetarian": false,
    "time": 45,
    "cheap": false,
    "glutenfree": false,
    "pricePerServing": 224.72,
    "servings": 3,
    "image": "https://spoonacular.com/recipeImages/636558-556x370.jpg"
  },
  {
    "description": "If you want to add more <b>gluten free and dairy free</b> recipes to your recipe box, Ham with Orange Rosemary Marmalade Glaze might be a recipe you should try. One serving contains <b>3119 calories</b>, <b>246g of protein</b>, and <b>191g of fat</b>. For <b>$4.9 per serving</b>, this recipe <b>covers 58%</b> of your daily requirements of vitamins and minerals. This recipe serves 4. This recipe from Foodista requires ham, orange marmalade, ginger, and brown sugar. 61 person were impressed by this recipe. From preparation to the plate, this recipe takes about <b>about 45 minutes</b>. Taking all factors into account, this recipe <b>earns a spoonacular score of 95%</b>, which is tremendous. <a href=\"https://spoonacular.com/recipes/baked-ham-with-marmalade-horseradish-glaze-42455\">Baked Ham with Marmalade-Horseradish Glaze</a>, <a href=\"https://spoonacular.com/recipes/ham-and-peach-kebabs-with-marmalade-mustard-glaze-17435\">Ham and Peach Kebabs with Marmalade-Mustard Glaze</a>, and <a href=\"https://spoonacular.com/recipes/pork-and-ham-loaf-with-marmalade-mustard-glaze-733892\">Pork and Ham Loaf with Marmalade-Mustard Glaze</a> are very similar to this recipe.",
    "title": "Ham with Orange Rosemary Marmalade Glaze",
    "vegetarian": false,
    "time": 45,
    "cheap": false,
    "glutenfree": true,
    "pricePerServing": 489.7,
    "servings": 4,
    "image": "https://spoonacular.com/recipeImages/646217-556x370.jpg"
  },
  {
    "description": "Easy Asian Sweet Chili Chicken Meatballs might be just the main course you are searching for. Watching your figure? This dairy free recipe has <b>270 calories</b>, <b>18g of protein</b>, and <b>8g of fat</b> per serving. For <b>$1.52 per serving</b>, this recipe <b>covers 16%</b> of your daily requirements of vitamins and minerals. From preparation to the plate, this recipe takes roughly <b>45 minutes</b>. This recipe is typical of American cuisine. 12 people have made this recipe and would make it again. It will be a hit at your <b>The Super Bowl</b> event. Head to the store and pick up pepper flakes, rice wine vinegar, cornstarch, and a few other things to make it today. To use up the cabbage you could follow this main course with the <a href=\"https://spoonacular.com/recipes/cabbage-that-tastes-like-dessert-92896\">Cabbage That Tastes Like Dessert!</a> as a dessert. All things considered, we decided this recipe <b>deserves a spoonacular score of 56%</b>. This score is solid. Try <a href=\"https://spoonacular.com/recipes/asian-sweet-chili-chicken-861359\">Asian Sweet Chili Chicken</a>, <a href=\"https://spoonacular.com/recipes/sweet-chili-chicken-with-asian-vegetable-rice-101145\">Sweet Chili Chicken With Asian Vegetable Rice</a>, and <a href=\"https://spoonacular.com/recipes/turkey-or-chicken-meatballs-with-sweet-chili-sauce-138000\">Turkey (Or Chicken) Meatballs With Sweet Chili Sauce</a> for similar recipes.",
    "title": "Easy Asian Sweet Chili Chicken Meatballs",
    "vegetarian": false,
    "time": 45,
    "cheap": false,
    "glutenfree": false,
    "pricePerServing": 137.32,
    "servings": 6,
    "image": "https://spoonacular.com/recipeImages/803061-556x370.jpg"
  },
  {
    "description": "One serving contains <b>169 calories</b>, <b>0g of protein</b>, and <b>5g of fat</b>. For <b>77 cents per serving</b>, this recipe <b>covers 2%</b> of your daily requirements of vitamins and minerals. This recipe is liked by 101 foodies and cooks. Head to the store and pick up basil leaves, strawberries, honey, and a few other things to make it today. It is perfect for <b>Mother's Day</b>. It is a good option if you're following a <b>gluten free, dairy free, and vegetarian</b> diet. From preparation to the plate, this recipe takes around <b>45 minutes</b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 26%</b>. This score is not so excellent. Try <a href=\"https://spoonacular.com/recipes/strawberry-sorbet-without-an-ice-cream-maker-12bloggers-581814\">Strawberry Sorbet (without an ice cream maker) #12Bloggers</a>, <a href=\"https://spoonacular.com/recipes/coconut-mango-pineapple-sorbet-+-ice-cream-maker-giveaway-607524\">Coconut Mango-Pineapple Sorbet + Ice Cream Maker Giveaway</a>, and <a href=\"https://spoonacular.com/recipes/strawberry-basil-sorbet-bellini-529004\">Strawberry Basil Sorbet Bellini</a> for similar recipes.",
    "title": "Strawberry Basil Sorbet (no Ice Cream Maker Necessary!)",
    "vegetarian": true,
    "time": 45,
    "cheap": false,
    "glutenfree": true,
    "pricePerServing": 76.94,
    "servings": 1,
    "image": "https://spoonacular.com/recipeImages/716424-556x370.jpg"
  },
  {
    "description": "Moroccan chickpean and lentil stew is a <b>dairy free, lacto ovo vegetarian, and vegan</b> main course. One portion of this dish contains around <b>20g of protein</b>, <b>7g of fat</b>, and a total of <b>467 calories</b>. This recipe serves 3. For <b>$1.34 per serving</b>, this recipe <b>covers 30%</b> of your daily requirements of vitamins and minerals. 11 person found this recipe to be tasty and satisfying. It will be a hit at your <b>Autumn</b> event. This recipe from Foodista requires lemon juice, ground turmeric, carrots, and ground cumin. From preparation to the plate, this recipe takes around <b>30 minutes</b>. With a spoonacular <b>score of 95%</b>, this dish is amazing. Users who liked this recipe also liked <a href=\"https://spoonacular.com/recipes/butternut-squash-chickpea-lentil-moroccan-stew-523871\">Butternut Squash, Chickpea & Lentil Moroccan Stew</a>, <a href=\"https://spoonacular.com/recipes/crockpot-moroccan-lentil-and-chickpea-soup-840995\">Crockpot Moroccan Lentil and Chickpea Soup</a>, and <a href=\"https://spoonacular.com/recipes/moroccan-chickpea-and-lentil-soup-harira-977492\">Moroccan Chickpean and Lentil Soup (Harira)</a>.",
    "title": "Moroccan chickpea and lentil stew",
    "vegetarian": true,
    "time": 30,
    "cheap": false,
    "glutenfree": false,
    "pricePerServing": 126.12,
    "servings": 3,
    "image": "https://spoonacular.com/recipeImages/652417-556x370.jpg"
  },
  {
    "description": "If you have about <b>approximately 45 minutes</b> to spend in the kitchen, Rustic Brie Toasts with Wild Mushroom, Cranberry and Shallot might be an excellent <b>lacto ovo vegetarian</b> recipe to try. This recipe serves 10 and costs 66 cents per serving. One serving contains <b>162 calories</b>, <b>8g of protein</b>, and <b>9g of fat</b>. This recipe from Foodista requires wedge of beautiful brie cheese, rustic baguette, olive oil, and salt and pepper. 18 people have tried and liked this recipe. Overall, this recipe earns a <b>good spoonacular score of 46%</b>. If you like this recipe, you might also like recipes such as <a href=\"https://spoonacular.com/recipes/brie-toasts-with-cranberry-compote-430592\">Brie Toasts with Cranberry Compote</a>, <a href=\"https://spoonacular.com/recipes/brown-sugar-cured-turkey-with-wild-mushroom-shallot-gravy-116265\">Brown Sugar-Cured Turkey with Wild Mushroom-Shallot Gravy</a>, and <a href=\"https://spoonacular.com/recipes/brie-and-wild-mushroom-soup-394447\">Brie and Wild Mushroom Soup</a>.",
    "title": "Rustic Brie Toasts with Wild Mushroom, Cranberry and Shallot",
    "vegetarian": true,
    "time": 45,
    "cheap": false,
    "glutenfree": false,
    "pricePerServing": 66.25,
    "servings": 10,
    "image": "https://spoonacular.com/recipeImages/658914-556x370.jpg"
  },
  {
    "description": "Apple & Cream Cheese Braid might be just the main course you are searching for. One serving contains <b>5803 calories</b>, <b>122g of protein</b>, and <b>244g of fat</b>. This recipe serves 1 and costs $10.37 per serving. 7 people were impressed by this recipe. Head to the store and pick up butter, milk, butter, and a few other things to make it today. To use up the blanched almonds you could follow this main course with the <a href=\"https://spoonacular.com/recipes/pinecone-cakes-130809\">Pinecone Cakes</a> as a dessert. From preparation to the plate, this recipe takes approximately <b>45 minutes</b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 93%</b>. This score is great. Try <a href=\"https://spoonacular.com/recipes/apricot-cream-cheese-braid-48773\">Apricot-Cream Cheese Braid</a>, <a href=\"https://spoonacular.com/recipes/cream-cheese-danish-braid-340942\">Cream Cheese Danish Braid</a>, and <a href=\"https://spoonacular.com/recipes/cherry-cream-cheese-danish-braid-918120\">Cherry Cream Cheese Danish Braid</a> for similar recipes.",
    "title": "Apple & Cream Cheese Braid",
    "vegetarian": false,
    "time": 45,
    "cheap": false,
    "glutenfree": false,
    "pricePerServing": 1036.55,
    "servings": 1,
    "image": "https://spoonacular.com/recipeImages/632452-556x370.jpg"
  },
  {
    "description": "Need a <b>lacto ovo vegetarian hor d'oeuvre</b>? Gluten Free Onion Rings could be an amazing recipe to try. This recipe serves 4. One serving contains <b>361 calories</b>, <b>8g of protein</b>, and <b>19g of fat</b>. For <b>83 cents per serving</b>, this recipe <b>covers 8%</b> of your daily requirements of vitamins and minerals. 38 people found this recipe to be yummy and satisfying. It is brought to you by Foodista. If you have egg, all purpose flour, salt, and a few other ingredients on hand, you can make it. From preparation to the plate, this recipe takes around <b>around 45 minutes</b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 30%</b>. This score is rather bad. If you like this recipe, take a look at these similar recipes: <a href=\"https://spoonacular.com/recipes/gluten-free-onion-rings-ii-562910\">Gluten Free Onion Rings II</a>, <a href=\"https://spoonacular.com/recipes/crispy-gluten-free-onion-rings-979447\">Crispy Gluten Free Onion Rings</a>, and <a href=\"https://spoonacular.com/recipes/baked-onion-rings-gluten-free-520113\">Baked Onion Rings (Gluten Free)</a>.",
    "title": "Gluten Free Onion Rings",
    "vegetarian": true,
    "time": 45,
    "cheap": false,
    "glutenfree": false,
    "pricePerServing": 83.07,
    "servings": 4,
    "image": "https://spoonacular.com/recipeImages/644846-556x370.jpg"
  },
  {
    "description": "Roasted Cranberries, Ricotta & Honey Crostini might be just the hor d'oeuvre you are searching for. One serving contains <b>334 calories</b>, <b>3g of protein</b>, and <b>1g of fat</b>. For <b>84 cents per serving</b>, this recipe <b>covers 6%</b> of your daily requirements of vitamins and minerals. It can be enjoyed any time, but it is especially good for <b>Christmas</b>. This recipe is typical of Mediterranean cuisine. 548 people have made this recipe and would make it again. If you have roasted cranberry sauce, roasted cranberry sauce, honey, and a few other ingredients on hand, you can make it. From preparation to the plate, this recipe takes about <b>45 minutes</b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 29%</b>. This score is rather bad. Try <a href=\"https://spoonacular.com/recipes/roasted-fig-ricotta-pistachio-honey-crostini-721464\">Roasted Fig, Ricotta, Pistachio & Honey Crostini</a>, <a href=\"https://spoonacular.com/recipes/honey-chipotle-roasted-parsnip-and-carrot-crostini-with-whipped-ricotta-and-pesto-619399\">Honey Chipotle-Roasted Parsnip and Carrot Crostini with Whipped Ricottan and Pesto</a>, and <a href=\"https://spoonacular.com/recipes/maple-honey-roasted-carrot-noodle-ricotta-crostini-with-coconut-flakes-563844\">Maple-Honey Roasted Carrot Noodle Ricotta Crostini with Coconut Flakes</a> for similar recipes.",
    "title": "Roasted Cranberries, Ricotta & Honey Crostini",
    "vegetarian": false,
    "time": 45,
    "cheap": false,
    "glutenfree": false,
    "pricePerServing": 84.04,
    "servings": 1,
    "image": "https://spoonacular.com/recipeImages/716412-556x370.jpg"
  },
  {
    "description": "You can never have too many main course recipes, so give Easy Chicken, Kielbasan and Shrimp Paellan a try. This gluten free, dairy free, and fodmap friendly recipe serves 8 and costs <b>$2.38 per serving</b>. One serving contains <b>408 calories</b>, <b>34g of protein</b>, and <b>10g of fat</b>. This recipe is typical of European cuisine. If you have picante sauce, chicken breast strips, ground turmeric, and a few other ingredients on hand, you can make it. 19 people have tried and liked this recipe. From preparation to the plate, this recipe takes about <b>45 minutes</b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 63%</b>. This score is solid. Try <a href=\"https://spoonacular.com/recipes/easy-shrimp-and-chicken-paella-838618\">Easy Shrimp and Chicken Paella</a>, <a href=\"https://spoonacular.com/recipes/shrimp-and-scallop-easy-paella-301298\">Shrimp and Scallop Easy Paella</a>, and <a href=\"https://spoonacular.com/recipes/chicken-and-shrimp-paella-198233\">Chicken and Shrimp Paella</a> for similar recipes.",
    "title": "Easy Chicken, Kielbasa and Shrimp Paella",
    "vegetarian": false,
    "time": 45,
    "cheap": false,
    "glutenfree": true,
    "pricePerServing": 238.13,
    "servings": 8,
    "image": "https://spoonacular.com/recipeImages/641911-556x370.jpg"
  },
  {
    "description": "Coconut Macaroons With Chocolate Drizzle could be just the <b>lacto ovo vegetarian</b> recipe you've been looking for. This recipe serves 24. For <b>27 cents per serving</b>, this recipe <b>covers 3%</b> of your daily requirements of vitamins and minerals. One portion of this dish contains roughly <b>2g of protein</b>, <b>7g of fat</b>, and a total of <b>156 calories</b>. 10 people were impressed by this recipe. This recipe from Foodista requires condensed milk, coconut, salt, and vanillan extract. From preparation to the plate, this recipe takes roughly <b>roughly 45 minutes</b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 16%</b>. This score is not so excellent. <a href=\"https://spoonacular.com/recipes/coconut-macaroons-with-chocolate-drizzle-587512\">Coconut Macaroons with Chocolate Drizzle</a>, <a href=\"https://spoonacular.com/recipes/coconut-ginger-macaroons-with-chocolate-drizzle-42229\">Coconut Ginger Macaroons With Chocolate Drizzle</a>, and <a href=\"https://spoonacular.com/recipes/not-your-mothers-mounds-bar-hot-chocolate-with-coconut-rum-toasted-coconut-and-homemade-chocolate-drizzle-522478\">Not Your Mother’s Mounds Bar – Hot Chocolate with Coconut Rum, Toasted Coconut and Homemade Chocolate Drizzle</a> are very similar to this recipe.",
    "title": "Coconut Macaroons With Chocolate Drizzle",
    "vegetarian": true,
    "time": 45,
    "cheap": false,
    "glutenfree": false,
    "pricePerServing": 27.23,
    "servings": 24,
    "image": "https://spoonacular.com/recipeImages/639779-556x370.jpg"
  },
  {
    "description": "If you have roughly <b>about 45 minutes</b> to spend in the kitchen, Beans Hawaiian might be an amazing <b>gluten free and dairy free</b> recipe to try. This recipe serves 8 and costs $1.61 per serving. One portion of this dish contains about <b>29g of protein</b>, <b>10g of fat</b>, and a total of <b>442 calories</b>. This recipe from Foodista requires navy beans, brown sugar, bacon, and ham steak. Not a lot of people made this recipe, and 6 would say it hit the spot. Overall, this recipe earns a <b>pretty good spoonacular score of 63%</b>. Similar recipes include <a href=\"https://spoonacular.com/recipes/hawaiian-barbecue-beans-424564\">Hawaiian Barbecue Beans</a>, <a href=\"https://spoonacular.com/recipes/green-beans-with-fermented-black-beans-aka-dirty-green-beans-603179\">green beans with fermented black beans ~ aka dirty green beans</a>, and <a href=\"https://spoonacular.com/recipes/blue-hawaiian-127693\">Blue Hawaiian</a>.",
    "title": "Beans Hawaiian",
    "vegetarian": false,
    "time": 45,
    "cheap": false,
    "glutenfree": true,
    "pricePerServing": 161.29,
    "servings": 8,
    "image": "https://spoonacular.com/recipeImages/634545-556x370.jpg"
  },
  {
    "description": "Easy Baked Pork Chop is a <b>gluten free, dairy free, and fodmap friendly</b> main course. For <b>$3.19 per serving</b>, this recipe <b>covers 31%</b> of your daily requirements of vitamins and minerals. One serving contains <b>519 calories</b>, <b>59g of protein</b>, and <b>28g of fat</b>. 404 people were impressed by this recipe. A mixture of soy sauce, worcestershire sauce, vegetable oil, and a handful of other ingredients are all it takes to make this recipe so flavorful. To use up the lemon juice you could follow this main course with the <a href=\"https://spoonacular.com/recipes/lemon-shortbread-cookies-with-lemon-icing-a-tribute-to-aunt-roxanne-487814\">Lemon Shortbread Cookies with Lemon Icing {A Tribute to Aunt Roxanne}</a> as a dessert. From preparation to the plate, this recipe takes approximately <b>45 minutes</b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 92%</b>. This score is spectacular. Try <a href=\"https://spoonacular.com/recipes/easy-dinner-s-baked-pork-chop-528251\">Easy Dinner s: Baked Pork Chop</a>, <a href=\"https://spoonacular.com/recipes/one-dish-baked-pork-chop-dinner-526437\">One Dish Baked Pork Chop Dinner</a>, and <a href=\"https://spoonacular.com/recipes/quick-easy-pork-chop-skillet-278477\">Quick & Easy Pork Chop Skillet</a> for similar recipes.",
    "title": "Easy Baked Pork Chop",
    "vegetarian": false,
    "time": 45,
    "cheap": false,
    "glutenfree": true,
    "pricePerServing": 318.81,
    "servings": 3,
    "image": "https://spoonacular.com/recipeImages/715481-556x370.jpg"
  },
  {
    "description": "Lemon Coconut Granola might be just the morn meal you are searching for. Watching your figure? This gluten free, dairy free, and vegetarian recipe has <b>263 calories</b>, <b>6g of protein</b>, and <b>16g of fat</b> per serving. For <b>56 cents per serving</b>, this recipe <b>covers 9%</b> of your daily requirements of vitamins and minerals. 32 people have made this recipe and would make it again. If you have rolled oats, honey, currants, and a few other ingredients on hand, you can make it. From preparation to the plate, this recipe takes roughly <b>45 minutes</b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 63%</b>. This score is pretty good. Try <a href=\"https://spoonacular.com/recipes/lemon-coconut-granola-bites-516534\">Lemon Coconut Granola Bites</a>, <a href=\"https://spoonacular.com/recipes/full-house-coconut-cupcakes-lemon-curd-filling-coconut-lemon-buttercream-frosting-toasted-coconut-294081\">Full House: Coconut Cupcakes, Lemon Curd Filling, Coconut-Lemon Buttercream Frosting, Toasted Coconut</a>, and <a href=\"https://spoonacular.com/recipes/roasted-blueberry-coconut-quinoa-parfaits-with-coconut-granola-525222\">Roasted Blueberry Coconut Quinoa Parfaits with Coconut Granola</a> for similar recipes.",
    "title": "Lemon Coconut Granola",
    "vegetarian": true,
    "time": 45,
    "cheap": false,
    "glutenfree": true,
    "pricePerServing": 56.12,
    "servings": 15,
    "image": "https://spoonacular.com/recipeImages/649567-556x370.jpg"
  },
  {
    "description": "Roasted Cabbage Wedge Salad with Yogurt Gorgonzola Dressing might be just the main course you are searching for. One serving contains <b>187 calories</b>, <b>12g of protein</b>, and <b>11g of fat</b>. This gluten free recipe serves 4 and costs <b>$1.3 per serving</b>. Several people made this recipe, and 550 would say it hit the spot. If you have bacon, scallions, gorgonzola, and a few other ingredients on hand, you can make it. To use up the grapeseed oil you could follow this main course with the <a href=\"https://spoonacular.com/recipes/strawberry-crumble-552593\">Strawberry Crumble</a> as a dessert. From preparation to the plate, this recipe takes around <b>45 minutes</b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 70%</b>. This score is solid. Try <a href=\"https://spoonacular.com/recipes/iceberg-wedge-salad-with-creamy-gorgonzola-dressing-392199\">Iceberg Wedge Salad with Creamy Gorgonzola Dressing</a>, <a href=\"https://spoonacular.com/recipes/southwestern-wedge-salad-with-green-chile-yogurt-dressing-628400\">Southwestern Wedge Salad with Green Chile Yogurt Dressing</a>, and <a href=\"https://spoonacular.com/recipes/roasted-cabbage-wedge-salad-566060\">Roasted Cabbage Wedge Salad</a> for similar recipes.",
    "title": "Roasted Cabbage Wedge Salad with Yogurt Gorgonzola Dressing",
    "vegetarian": false,
    "time": 45,
    "cheap": false,
    "glutenfree": true,
    "pricePerServing": 129.8,
    "servings": 4,
    "image": "https://spoonacular.com/recipeImages/716430-556x370.jpg"
  },
  {
    "description": "Easy Baked Parmesan Chicken takes about <b>about 45 minutes</b> from beginning to end. This recipe makes 4 servings with <b>598 calories</b>, <b>67g of protein</b>, and <b>18g of fat</b> each. For <b>$3.51 per serving</b>, this recipe <b>covers 38%</b> of your daily requirements of vitamins and minerals. It is brought to you by Foodista. 92 people were impressed by this recipe. If you have chicken breast halves, egg, parmesan cheese, and a few other ingredients on hand, you can make it. Taking all factors into account, this recipe <b>earns a spoonacular score of 93%</b>, which is great. <a href=\"https://spoonacular.com/recipes/easy-parmesan-baked-chicken-137192\">Easy Parmesan Baked Chicken</a>, <a href=\"https://spoonacular.com/recipes/weight-watchers-easy-healthy-baked-chicken-parmesan-525488\">Weight Watchers Easy Healthy Baked Chicken Parmesan</a>, and <a href=\"https://spoonacular.com/recipes/easy-baked-parmesan-meatballs-266567\">Easy Baked Parmesan Meatballs</a> are very similar to this recipe.",
    "title": "Easy Baked Parmesan Chicken",
    "vegetarian": false,
    "time": 45,
    "cheap": false,
    "glutenfree": false,
    "pricePerServing": 351.25,
    "servings": 4,
    "image": "https://spoonacular.com/recipeImages/641836-556x370.jpg"
  },
  {
    "description": "The recipe Healthy Vegan Red Velvet Brownies could satisfy your American craving in roughly <b>45 minutes</b>. Watching your figure? This gluten free and vegan recipe has <b>182 calories</b>, <b>5g of protein</b>, and <b>5g of fat</b> per serving. For <b>42 cents per serving</b>, this recipe <b>covers 8%</b> of your daily requirements of vitamins and minerals. A couple people made this recipe, and 91 would say it hit the spot. It is perfect for <b>valentin day</b>. A mixture of cocoa powder, apple sauce, brown sugar, and a handful of other ingredients are all it takes to make this recipe so delicious. All things considered, we decided this recipe <b>deserves a spoonacular score of 71%</b>. This score is solid. Try <a href=\"https://spoonacular.com/recipes/healthy-red-velvet-quinoa-brownies-735043\">Healthy Red Velvet Quinoa Brownies</a>, <a href=\"https://spoonacular.com/recipes/red-velvet-cake-roll-912616\">Red Velvet Cake Roll</a>, and <a href=\"https://spoonacular.com/recipes/healthy-vegan-chocolate-coconut-brownies-730405\">Healthy Vegan Chocolate Coconut Brownies</a> for similar recipes.",
    "title": "Healthy Vegan Red Velvet Brownies",
    "vegetarian": true,
    "time": 45,
    "cheap": false,
    "glutenfree": true,
    "pricePerServing": 41.99,
    "servings": 8,
    "image": "https://spoonacular.com/recipeImages/646524-556x370.jpg"
  },
  {
    "description": "Need a <b>gluten free, dairy free, lacto ovo vegetarian, and fodmap friendly dessert</b>? Guf\" Danish Ice Cream Topping could be an excellent recipe to try. For <b>40 cents per serving</b>, this recipe <b>covers 2%</b> of your daily requirements of vitamins and minerals. This recipe serves 4. One portion of this dish contains about <b>2g of protein</b>, <b>0g of fat</b>, and a total of <b>71 calories</b>. 39 people were impressed by this recipe. It will be a hit at your <b>Summer</b> event. From preparation to the plate, this recipe takes around <b>around 45 minutes</b>. This recipe from Foodista requires , strawberries, sugar, and lemon juice. All things considered, we decided this recipe <b>deserves a spoonacular score of 25%</b>. This score is not so amazing. If you like this recipe, you might also like recipes such as <a href=\"https://spoonacular.com/recipes/pineapple-ice-cream-topping-384820\">Pineapple Ice Cream Topping</a>, <a href=\"https://spoonacular.com/recipes/blueberry-ice-cream-topping-368218\">Blueberry Ice Cream Topping</a>, and <a href=\"https://spoonacular.com/recipes/chocolate-ice-cream-topping-388111\">Chocolate Ice Cream Topping</a>.",
    "title": "Guf\" Danish Ice Cream Topping",
    "vegetarian": true,
    "time": 45,
    "cheap": false,
    "glutenfree": true,
    "pricePerServing": 39.5,
    "servings": 4,
    "image": "https://spoonacular.com/recipeImages/631781-556x370.jpg"
  },
  {
    "description": "Banana Foster Bread Pudding requires roughly <b>roughly 45 minutes</b> from start to finish. This recipe serves 8 and costs $1.75 per serving. Watching your figure? This lacto ovo vegetarian recipe has <b>1040 calories</b>, <b>12g of protein</b>, and <b>45g of fat</b> per serving. A couple people made this recipe, and 27 would say it hit the spot. This recipe from Foodista requires bananas, bananas, milk, and heavy cream. It works well as a dessert. Overall, this recipe earns a <b>solid spoonacular score of 44%</b>. Users who liked this recipe also liked <a href=\"https://spoonacular.com/recipes/bananas-foster-banana-pudding-842550\">Bananas Foster Banana Pudding</a>, <a href=\"https://spoonacular.com/recipes/bananas-foster-bread-pudding-620617\">Bananas Foster Bread Pudding</a>, and <a href=\"https://spoonacular.com/recipes/bananas-foster-bread-pudding-68803\">Bananas Foster Bread Pudding</a>.",
    "title": "Banana Foster Bread Pudding",
    "vegetarian": true,
    "time": 45,
    "cheap": false,
    "glutenfree": false,
    "pricePerServing": 174.61,
    "servings": 8,
    "image": "https://spoonacular.com/recipeImages/634091-556x370.jpg"
  },
  {
    "description": "Need a <b>gluten free and vegan main course</b>? Easy Homemade Rice and Beans could be a great recipe to try. One serving contains <b>446 calories</b>, <b>19g of protein</b>, and <b>4g of fat</b>. For <b>$1.06 per serving</b>, this recipe <b>covers 26%</b> of your daily requirements of vitamins and minerals. 471 person have made this recipe and would make it again. A mixture of olive oil, ground pepper, onion, and a handful of other ingredients are all it takes to make this recipe so yummy. To use up the olive oil you could follow this main course with the <a href=\"https://spoonacular.com/recipes/sauteed-banana-granola-and-yogurt-parfait-624619\">Sauteed Banana, Granolan and Yogurt Parfait</a> as a dessert. From preparation to the plate, this recipe takes approximately <b>35 minutes</b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 99%</b>. This score is awesome. Try <a href=\"https://spoonacular.com/recipes/easy-homemade-refried-beans-619117\">Easy homemade refried beans</a>, <a href=\"https://spoonacular.com/recipes/homemade-southern-red-beans-and-rice-243655\">Homemade Southern Red Beans and Rice</a>, and <a href=\"https://spoonacular.com/recipes/skillet-chicken-with-homemade-rice-a-roni-and-green-beans-201454\">Skillet Chicken with Homemade Rice-A-Roni and Green Beans</a> for similar recipes.",
    "title": "Easy Homemade Rice and Beans",
    "vegetarian": true,
    "time": 35,
    "cheap": false,
    "glutenfree": true,
    "pricePerServing": 106.02,
    "servings": 2,
    "image": "https://spoonacular.com/recipeImages/716627-556x370.jpg"
  },
  {
    "description": "Valentine's Chicken Marsala might be a good recipe to expand your main course repertoire. This recipe serves 3 and costs $2.72 per serving. One serving contains <b>549 calories</b>, <b>13g of protein</b>, and <b>21g of fat</b>. If you have mushrooms, olive oil, marsala wine, and a few other ingredients on hand, you can make it. 94 people were impressed by this recipe. It is brought to you by Foodista. From preparation to the plate, this recipe takes approximately <b>approximately 45 minutes</b>. Overall, this recipe earns a <b>not so super spoonacular score of 38%</b>. <a href=\"https://spoonacular.com/recipes/buitoni-chicken-marsala-ravioli-with-mushroom-marsala-cream-sauce-549770\">Buitoni Chicken Marsala Ravioli with Mushroom Marsala Cream Sauce</a>, <a href=\"https://spoonacular.com/recipes/chicken-marsala-248083\">Chicken Marsala</a>, and <a href=\"https://spoonacular.com/recipes/chicken-marsala-74112\">Chicken Marsala</a> are very similar to this recipe.",
    "title": "Valentine's Chicken Marsala",
    "vegetarian": false,
    "time": 45,
    "cheap": false,
    "glutenfree": false,
    "pricePerServing": 271.68,
    "servings": 3,
    "image": "https://spoonacular.com/recipeImages/664270-556x370.jpg"
  },
  {
    "description": "The recipe Popcorn Chicken is ready <b>in about 45 minutes</b> and is definitely a tremendous <b>dairy free</b> option for lovers of American food. This recipe serves 2 and costs $1.59 per serving. One serving contains <b>823 calories</b>, <b>43g of protein</b>, and <b>14g of fat</b>. Plenty of people made this recipe, and 100 would say it hit the spot. It works well as a reasonably priced main course. If you have eggs, salt, chili powder, and a few other ingredients on hand, you can make it. To use up the eggs you could follow this main course with the <a href=\"https://spoonacular.com/recipes/rose-levy-beranbaums-chocolate-tomato-cake-with-mystery-ganache-27408\">Rose Levy Beranbaum's Chocolate Tomato Cake with Mystery Ganache</a> as a dessert. All things considered, we decided this recipe <b>deserves a spoonacular score of 96%</b>. This score is great. Try <a href=\"https://spoonacular.com/recipes/popcorn-chicken-how-to-make-kfc-style-popcorn-chicken-666002\">popcorn chicken , how to make kfc style popcorn chicken</a>, <a href=\"https://spoonacular.com/recipes/popcorn-coated-popcorn-chicken-753429\">Popcorn-Coated Popcorn Chicken</a>, and <a href=\"https://spoonacular.com/recipes/champagne-caramel-popcorn-bacon-truffle-parmesan-popcorn-837731\">Champagne Caramel Popcorn & Bacon Truffle Parmesan Popcorn</a> for similar recipes.",
    "title": "Popcorn Chicken",
    "vegetarian": false,
    "time": 45,
    "cheap": false,
    "glutenfree": false,
    "pricePerServing": 158.71,
    "servings": 2,
    "image": "https://spoonacular.com/recipeImages/716358-556x370.jpg"
  },
  {
    "description": "Need a <b>gluten free and lacto ovo vegetarian side dish</b>? Paneer Makhani could be an outstanding recipe to try. One serving contains <b>295 calories</b>, <b>9g of protein</b>, and <b>26g of fat</b>. For <b>$2.05 per serving</b>, this recipe <b>covers 4%</b> of your daily requirements of vitamins and minerals. This recipe serves 4. This recipe from Foodista has 10 fans. Head to the store and pick up paneer, salt, cumin powder, and a few other things to make it today. From preparation to the plate, this recipe takes approximately <b>approximately 45 minutes</b>. Taking all factors into account, this recipe <b>earns a spoonacular score of 12%</b>, which is not so awesome. Try <a href=\"https://spoonacular.com/recipes/paneer-makhani-how-to-make-paneer-makhani-paneer-s-486628\">paneer makhani , how to make paneer makhani | paneer s</a>, <a href=\"https://spoonacular.com/recipes/paneer-makhani-paneer-butter-masala-restaurant-style-600613\">Paneer Makhani (Paneer Butter Masala) (Restaurant Style)</a>, and <a href=\"https://spoonacular.com/recipes/paneer-makhani-667926\">Paneer Makhani</a> for similar recipes.",
    "title": "Paneer Makhani",
    "vegetarian": true,
    "time": 45,
    "cheap": false,
    "glutenfree": true,
    "pricePerServing": 205.38,
    "servings": 4,
    "image": "https://spoonacular.com/recipeImages/654534-556x370.jpg"
  },
  {
    "description": "Forget going out to eat or ordering takeout every time you crave Mediterranean food. Try making Strawberry Cheesecake Chocolate Crepes at home. This recipe serves 4. One serving contains <b>638 calories</b>, <b>16g of protein</b>, and <b>38g of fat</b>. For <b>$1.69 per serving</b>, this recipe <b>covers 20%</b> of your daily requirements of vitamins and minerals. This recipe from Pink When has 1928 fans. Several people really liked this breakfast. <b>Mother's Day</b> will be even more special with this recipe. From preparation to the plate, this recipe takes around <b>40 minutes</b>. If you have cream cheese, cocoa powder, granulated sugar, and a few other ingredients on hand, you can make it. It is a good option if you're following a <b>lacto ovo vegetarian</b> diet. With a spoonacular <b>score of 0%</b>, this dish is very bad (but still fixable). Users who liked this recipe also liked <a href=\"https://spoonacular.com/recipes/strawberry-cheesecake-crepes-1104545\">Strawberry Cheesecake Crepes</a>, <a href=\"https://spoonacular.com/recipes/chocolate-strawberry-crepes-306701\">Chocolate-Strawberry Crepes</a>, and <a href=\"https://spoonacular.com/recipes/chocolate-strawberry-crepes-with-caramel-sauce-294513\">Chocolate Strawberry Crepes with Caramel Sauce</a>.",
    "title": "Strawberry Cheesecake Chocolate Crepes",
    "vegetarian": true,
    "time": 40,
    "cheap": false,
    "glutenfree": false,
    "pricePerServing": 168.57,
    "servings": 4,
    "image": "https://spoonacular.com/recipeImages/715569-556x370.jpg"
  },
  {
    "description": "If you have approximately <b>45 minutes</b> to spend in the kitchen, Pierogi Casserole might be a tremendous <b>lacto ovo vegetarian</b> recipe to try. One portion of this dish contains around <b>31g of protein</b>, <b>32g of fat</b>, and a total of <b>814 calories</b>. For <b>$1.51 per serving</b>, this recipe <b>covers 29%</b> of your daily requirements of vitamins and minerals. This recipe serves 4. It is brought to you by Pink When. <b>Winter</b> will be even more special with this recipe. This recipe is typical of Eastern European cuisine. This recipe is liked by 1545 foodies and cooks. Plenty of people really liked this main course. A mixture of butter, sharp cheddar cheese, potatoes, and a handful of other ingredients are all it takes to make this recipe so yummy. With a spoonacular <b>score of 84%</b>, this dish is great. If you like this recipe, you might also like recipes such as <a href=\"https://spoonacular.com/recipes/easy-pierogi-casserole-276341\">Easy \"Pierogi\" Casserole</a>, <a href=\"https://spoonacular.com/recipes/american-pierogi-casserole-927459\">American Pierogi Casserole</a>, and <a href=\"https://spoonacular.com/recipes/kluski-pierogi-casserole-93276\">Kluski-Pierogi Casserole</a>.",
    "title": "Pierogi Casserole",
    "vegetarian": true,
    "time": 45,
    "cheap": false,
    "glutenfree": false,
    "pricePerServing": 155.09,
    "servings": 4,
    "image": "https://spoonacular.com/recipeImages/715563-556x370.jpg"
  },
  {
    "description": "Pink Lemonade Crinkle Cookies might be just the dessert you are searching for. Watching your figure? This vegetarian recipe has <b>659 calories</b>, <b>5g of protein</b>, and <b>29g of fat</b> per serving. For <b>54 cents per serving</b>, this recipe <b>covers 8%</b> of your daily requirements of vitamins and minerals. Many people made this recipe, and 3229 would say it hit the spot. If you have egg, baking soda, powdered sugar, and a few other ingredients on hand, you can make it. From preparation to the plate, this recipe takes about <b>45 minutes</b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 33%</b>. This score is not so super. Try <a href=\"https://spoonacular.com/recipes/frosted-pink-lemonade-cookies-544764\">Frosted Pink Lemonade Cookies</a>, <a href=\"https://spoonacular.com/recipes/homemade-pink-lemonade-cookies-534398\">Homemade Pink Lemonade Cookies</a>, and <a href=\"https://spoonacular.com/recipes/sour-patch-pink-lemonade-cookies-631616\">Sour Patch Pink Lemonade Cookies</a> for similar recipes.",
    "title": "Pink Lemonade Crinkle Cookies",
    "vegetarian": true,
    "time": 45,
    "cheap": false,
    "glutenfree": false,
    "pricePerServing": 53.93,
    "servings": 5,
    "image": "https://spoonacular.com/recipeImages/715541-556x370.jpg"
  },
  {
    "description": "The recipe How to Make Party Jollof Rice is ready <b>in about 45 minutes</b> and is definitely an amazing <b>gluten free and vegan</b> option for lovers of African food. For <b>$1.35 per serving</b>, this recipe <b>covers 20%</b> of your daily requirements of vitamins and minerals. This recipe makes 3 servings with <b>528 calories</b>, <b>12g of protein</b>, and <b>2g of fat</b> each. Many people made this recipe, and 347 would say it hit the spot. If you have bay leaves, roma tomatoes, salt, and a few other ingredients on hand, you can make it. All things considered, we decided this recipe <b>deserves a spoonacular score of 93%</b>. This score is outstanding. Try <a href=\"https://spoonacular.com/recipes/jollof-rice-with-chicken-from-ghana-728651\">Jollof Rice with Chicken from Ghana</a>, <a href=\"https://spoonacular.com/recipes/chex-party-mix-it-is-easy-to-make-599956\">Chex Party Mix – it is easy to make</a>, and <a href=\"https://spoonacular.com/recipes/make-ahead-party-mashed-potatoes-329849\">Make-Ahead Party Mashed Potatoes</a> for similar recipes.",
    "title": "How to Make Party Jollof Rice",
    "vegetarian": true,
    "time": 45,
    "cheap": false,
    "glutenfree": true,
    "pricePerServing": 122.98,
    "servings": 3,
    "image": "https://spoonacular.com/recipeImages/716298-556x370.jpg"
  },
  {
    "description": "Brownie Coffins takes roughly <b>about 45 minutes</b> from beginning to end. One portion of this dish contains about <b>5g of protein</b>, <b>22g of fat</b>, and a total of <b>358 calories</b>. This recipe serves 5. For <b>56 cents per serving</b>, this recipe <b>covers 7%</b> of your daily requirements of vitamins and minerals. A few people really liked this American dish. 15 people were glad they tried this recipe. It works well as a dessert. If you have baking powder, sugar, chocolate cocoa powder, and a few other ingredients on hand, you can make it. It is brought to you by Foodista. Overall, this recipe earns a <b>rather bad spoonacular score of 18%</b>. Try <a href=\"https://spoonacular.com/recipes/brownie-batter-cheesecakes-with-fudge-brownie-crust-549694\">Brownie Batter Cheesecakes with Fudge Brownie Crust</a>, <a href=\"https://spoonacular.com/recipes/chewy-brownie-bites-or-brownie-cookies-484028\">Chewy Brownie Bites or Brownie Cookies</a>, and <a href=\"https://spoonacular.com/recipes/cakespy-brownie-upside-down-brownie-206751\">Cakespy: Brownie Upside-Down Brownie</a> for similar recipes.",
    "title": "Brownie Coffins",
    "vegetarian": false,
    "time": 45,
    "cheap": false,
    "glutenfree": false,
    "pricePerServing": 55.55,
    "servings": 5,
    "image": "https://spoonacular.com/recipeImages/636328-556x370.jpg"
  },
  {
    "description": "Cornmeal-Crusted Catfish with Cajun Seasoning and Spicy Tartar Sauce is a main course that serves 4. One portion of this dish contains roughly <b>27g of protein</b>, <b>26g of fat</b>, and a total of <b>420 calories</b>. For <b>$2.87 per serving</b>, this recipe <b>covers 26%</b> of your daily requirements of vitamins and minerals. Not a lot of people made this recipe, and 8 would say it hit the spot. This recipe is typical of Cajun cuisine. From preparation to the plate, this recipe takes around <b>around 45 minutes</b>. If you have granulated garlic, dill pickle juice, scallion, and a few other ingredients on hand, you can make it. It is brought to you by Foodista. It is a good option if you're following a <b>gluten free and pescatarian</b> diet. Taking all factors into account, this recipe <b>earns a spoonacular score of 71%</b>, which is solid. Users who liked this recipe also liked <a href=\"https://spoonacular.com/recipes/spicy-catfish-tenders-with-cajun-tartar-sauce-86027\">Spicy Catfish Tenders With Cajun Tartar Sauce</a>, <a href=\"https://spoonacular.com/recipes/spicy-cornmeal-crusted-catfish-86038\">Spicy Cornmeal-crusted Catfish</a>, and <a href=\"https://spoonacular.com/recipes/spicy-cornmeal-crusted-catfish-86033\">Spicy Cornmeal-Crusted Catfish</a>.",
    "title": "Cornmeal-Crusted Catfish with Cajun Seasoning and Spicy Tartar Sauce",
    "vegetarian": false,
    "time": 45,
    "cheap": false,
    "glutenfree": true,
    "pricePerServing": 287.28,
    "servings": 4,
    "image": "https://spoonacular.com/recipeImages/640166-556x370.jpg"
  },
  {
    "description": "Bacon Wrapped Pork Tenderloin is a <b>caveman, gluten free, dairy free, and primal</b> main course. For <b>$2.2 per serving</b>, this recipe <b>covers 30%</b> of your daily requirements of vitamins and minerals. One serving contains <b>411 calories</b>, <b>51g of protein</b>, and <b>21g of fat</b>. A couple people made this recipe, and 55 would say it hit the spot. If you have garlic powder, pepper, sage, and a few other ingredients on hand, you can make it. To use up the black pepper you could follow this main course with the <a href=\"https://spoonacular.com/recipes/dr-pepper-cake-with-flour-cooked-frosting-539165\">Dr. Pepper Cake with Flour Cooked Frosting</a> as a dessert. From preparation to the plate, this recipe takes approximately <b>45 minutes</b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 91%</b>. This score is outstanding. Try <a href=\"https://spoonacular.com/recipes/bacon-wrapped-pork-tenderloin-81832\">Bacon-Wrapped Pork Tenderloin</a>, <a href=\"https://spoonacular.com/recipes/bacon-wrapped-pork-tenderloin-253608\">Bacon Wrapped Pork Tenderloin</a>, and <a href=\"https://spoonacular.com/recipes/bacon-wrapped-pork-tenderloin-687182\">Bacon Wrapped Pork Tenderloin</a> for similar recipes.",
    "title": "Bacon Wrapped Pork Tenderloin",
    "vegetarian": false,
    "time": 45,
    "cheap": false,
    "glutenfree": true,
    "pricePerServing": 257.42,
    "servings": 4,
    "image": "https://spoonacular.com/recipeImages/633344-556x370.jpg"
  },
  {
    "description": "Vegan Dirty Chai Pudding is a <b>gluten free and dairy free</b> recipe with 6 servings. One serving contains <b>325 calories</b>, <b>5g of protein</b>, and <b>22g of fat</b>. For <b>$1.93 per serving</b>, this recipe <b>covers 16%</b> of your daily requirements of vitamins and minerals. It works well as a dessert. 6 people have made this recipe and would make it again. This recipe from Foodista requires pudding, cinnamon, vanilla, and cocoa powder. From preparation to the plate, this recipe takes roughly <b>roughly 45 minutes</b>. Overall, this recipe earns a <b>pretty good spoonacular score of 76%</b>. Try <a href=\"https://spoonacular.com/recipes/dirty-chai-tapioca-pudding-with-oatmeal-raisin-cookie-crumble-940972\">Dirty Chai Tapioca Pudding with Oatmeal Raisin Cookie Crumble</a>, <a href=\"https://spoonacular.com/recipes/dirty-dirty-chai-625782\">Dirty Dirty Chai</a>, and <a href=\"https://spoonacular.com/recipes/dirty-chai-541786\">Dirty Chai</a> for similar recipes.",
    "title": "Vegan Dirty Chai Pudding",
    "vegetarian": false,
    "time": 45,
    "cheap": false,
    "glutenfree": true,
    "pricePerServing": 193.28,
    "servings": 6,
    "image": "https://spoonacular.com/recipeImages/664429-556x370.jpg"
  },
  {
    "description": "You can never have too many Mediterranean recipes, so give Ratatouille With Brie a try. This main course has <b>490 calories</b>, <b>14g of protein</b>, and <b>45g of fat</b> per serving. This gluten free, lacto ovo vegetarian, and primal recipe serves 4 and costs <b>$1.97 per serving</b>. If you have brie log such as alouette, plum tomatoes, zucchini, and a few other ingredients on hand, you can make it. This recipe from Foodista has 63 fans. From preparation to the plate, this recipe takes around <b>around 45 minutes</b>. Overall, this recipe earns a <b>pretty good spoonacular score of 72%</b>. If you like this recipe, take a look at these similar recipes: <a href=\"https://spoonacular.com/recipes/ratatouilles-ratatouille-thomas-kellers-confit-byaldi-498135\">Ratatouille’s Ratatouille (Thomas Keller’s Confit Byaldi)</a>, <a href=\"https://spoonacular.com/recipes/confit-byaldi-aka-ratatouilles-ratatouille-611946\">Confit Byaldi (aka Ratatouille’s Ratatouille)</a>, and <a href=\"https://spoonacular.com/recipes/brie-and-caramelized-shallots-puff-pastry-brie-tart-546740\">Brie and caramelized Shallots Puff Pastry Brie Tart</a>.",
    "title": "Ratatouille With Brie",
    "vegetarian": true,
    "time": 45,
    "cheap": false,
    "glutenfree": true,
    "pricePerServing": 196.79,
    "servings": 4,
    "image": "https://spoonacular.com/recipeImages/657939-556x370.jpg"
  },
  {
    "description": "Need a <b>gluten free, dairy free, and whole 30 main course</b>? Peri Peri Chicken and Savoury Rice could be an amazing recipe to try. This recipe makes 6 servings with <b>643 calories</b>, <b>40g of protein</b>, and <b>50g of fat</b> each. For <b>$1.64 per serving</b>, this recipe <b>covers 24%</b> of your daily requirements of vitamins and minerals. 336 people have made this recipe and would make it again. If you have sized lemon, chicken pieces, oregano, and a few other ingredients on hand, you can make it. To use up the ice cube you could follow this main course with the <a href=\"https://spoonacular.com/recipes/nectarine-blackberry-and-pecan-sundaes-50465\">Nectarine, Blackberry, and Pecan Sundaes</a> as a dessert. From preparation to the plate, this recipe takes approximately <b>45 minutes</b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 80%</b>. This score is solid. Try <a href=\"https://spoonacular.com/recipes/peri-peri-roast-chicken-with-new-potato-slaw-224251\">Peri-peri roast chicken with new potato slaw</a>, <a href=\"https://spoonacular.com/recipes/peri-peri-chicken-salad-with-charred-corn-801968\">Peri-Peri chicken salad with charred corn</a>, and <a href=\"https://spoonacular.com/recipes/grilled-peri-peri-chicken-thighs-918673\">Grilled peri-peri chicken thighs</a> for similar recipes.",
    "title": "Peri Peri Chicken and Savoury Rice",
    "vegetarian": false,
    "time": 45,
    "cheap": false,
    "glutenfree": true,
    "pricePerServing": 143.05,
    "servings": 6,
    "image": "https://spoonacular.com/recipeImages/716296-556x370.jpg"
  },
  {
    "description": "The recipe Savory Cheese Dill Scones could satisfy your Scottish craving in roughly <b>45 minutes</b>. One serving contains <b>215 calories</b>, <b>6g of protein</b>, and <b>11g of fat</b>. This recipe serves 12 and costs 30 cents per serving. It works well as an inexpensive morn meal. 40 people have tried and liked this recipe. A mixture of cottage cheese, a pinch of baking soda, pepper, and a handful of other ingredients are all it takes to make this recipe so tasty. It is a good option if you're following a <b>vegetarian</b> diet. All things considered, we decided this recipe <b>deserves a spoonacular score of 28%</b>. This score is not so super. Try <a href=\"https://spoonacular.com/recipes/savory-dill-and-caraway-scones-394210\">Savory Dill and Caraway Scones</a>, <a href=\"https://spoonacular.com/recipes/cheese-dill-scones-17417\">Cheese Dill Scones</a>, and <a href=\"https://spoonacular.com/recipes/savory-three-cheese-cream-cheese-pumpkin-scones-612392\">Savory Three Cheese Cream Cheese Pumpkin Scones</a> for similar recipes.",
    "title": "Savory Cheese Dill Scones",
    "vegetarian": true,
    "time": 45,
    "cheap": false,
    "glutenfree": false,
    "pricePerServing": 29.57,
    "servings": 12,
    "image": "https://spoonacular.com/recipeImages/659463-556x370.jpg"
  },
  {
    "description": "Steak with lemon and capers might be just the main course you are searching for. One serving contains <b>951 calories</b>, <b>47g of protein</b>, and <b>54g of fat</b>. For <b>$6.49 per serving</b>, this recipe <b>covers 32%</b> of your daily requirements of vitamins and minerals. From preparation to the plate, this recipe takes roughly <b>45 minutes</b>. 9 people were impressed by this recipe. It can be enjoyed any time, but it is especially good for <b>valentin day</b>. A mixture of flour, garlic, lemon wedges, and a handful of other ingredients are all it takes to make this recipe so flavorful. To use up the dry white wine you could follow this main course with the <a href=\"https://spoonacular.com/recipes/white-wine-frozen-yogurt-206235\">White Wine Frozen Yogurt</a> as a dessert. All things considered, we decided this recipe <b>deserves a spoonacular score of 73%</b>. This score is pretty good. Similar recipes include <a href=\"https://spoonacular.com/recipes/steak-salad-sandwiches-with-capers-30072\">Steak Salad Sandwiches with Capers</a>, <a href=\"https://spoonacular.com/recipes/steak-salad-with-arugula-parmesan-crispy-capers-8826\">Steak Salad With Arugula, Parmesan & Crispy Capers</a>, and <a href=\"https://spoonacular.com/recipes/chicken-with-lemon-and-capers-29925\">Chicken with Lemon and Capers</a>.",
    "title": "Steak with lemon and capers",
    "vegetarian": false,
    "time": 45,
    "cheap": false,
    "glutenfree": false,
    "pricePerServing": 646.43,
    "servings": 2,
    "image": "https://spoonacular.com/recipeImages/661531-556x370.jpg"
  },
  {
    "description": "Chicken Suya might be just the main course you are searching for. This recipe serves 1 and costs $3.22 per serving. Watching your figure? This gluten free, dairy free, and whole 30 recipe has <b>1070 calories</b>, <b>87g of protein</b>, and <b>71g of fat</b> per serving. If you have chicken, salt, cooking spoon groundnut oil, and a few other ingredients on hand, you can make it. To use up the onions you could follow this main course with the <a href=\"https://spoonacular.com/recipes/candy-corn-cupcakes-63881\">Candy Corn Cupcakes</a> as a dessert. This recipe from Afrolems has 56 fans. From preparation to the plate, this recipe takes approximately <b>45 minutes</b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 94%</b>. This score is tremendous. Try <a href=\"https://spoonacular.com/recipes/suya-nigerian-chicken-skewers-113497\">Suya (Nigerian Chicken Skewers)</a>, <a href=\"https://spoonacular.com/recipes/suya-swordfish-6571\">Suya Swordfish</a>, and <a href=\"https://spoonacular.com/recipes/i-aint-chicken-chicken-crispy-roasted-chicken-breasts-with-orange-and-cardamom-310658\">I Ain't Chicken Chicken: Crispy Roasted Chicken Breasts with Orange and Cardamom</a> for similar recipes.",
    "title": "Chicken Suya",
    "vegetarian": false,
    "time": 45,
    "cheap": false,
    "glutenfree": true,
    "pricePerServing": 186.02,
    "servings": 1,
    "image": "https://spoonacular.com/recipeImages/716342-556x370.jpg"
  },
  {
    "description": "The recipe Chicken and Sausage Jambalayan is ready <b>in approximately 1 hour and 15 minutes</b> and is definitely an amazing <b>gluten free and dairy free</b> option for lovers of Creole food. One serving contains <b>636 calories</b>, <b>27g of protein</b>, and <b>31g of fat</b>. For <b>$1.86 per serving</b>, you get a main course that serves 8. 2169 people have made this recipe and would make it again. Head to the store and pick up pepper, sausage, water, and a few other things to make it today. To use up the sausage you could follow this main course with the <a href=\"https://spoonacular.com/recipes/spooky-spider-cakes-225281\">Spooky spider cakes</a> as a dessert. All things considered, we decided this recipe <b>deserves a spoonacular score of 76%</b>. This score is solid. Try <a href=\"https://spoonacular.com/recipes/chicken-and-sausage-jambalaya-169574\">Chicken and Sausage Jambalaya</a>, <a href=\"https://spoonacular.com/recipes/chicken-and-sausage-jambalaya-569841\">Chicken and Sausage Jambalaya</a>, and <a href=\"https://spoonacular.com/recipes/chicken-and-sausage-jambalaya-94539\">Chicken and Sausage Jambalaya</a> for similar recipes.",
    "title": "Chicken and Sausage Jambalaya",
    "vegetarian": false,
    "time": 75,
    "cheap": false,
    "glutenfree": true,
    "pricePerServing": 188.06,
    "servings": 8,
    "image": "https://spoonacular.com/recipeImages/715545-556x370.jpg"
  }
]